android-file-transfer
appzapper
atom
caffeine
calibre
coconutbattery
dnscrypt
evernote
flux
grandperspective
iterm2
java
keka
namechanger
qlcolorcode
qlmarkdown
qlprettypatch
qlstephen
quicklook-csv
quicklook-json
rubymine
skype
slack
smcfancontrol
spectacle
spotifree
spotify
sublime-text
transmission
vlc
webstorm
