tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'bat'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'neovim'
brew 'pinentry-mac'
brew 'zsh'

cask 'font-source-code-pro'

cask 'firefox',             args: { appdir: '~/Applications' }
cask 'iterm2',              args: { appdir: '~/Applications' }
cask 'omnifocus',           args: { appdir: '~/Applications' }
cask 'sublime-merge',       args: { appdir: '~/Applications' }
cask 'sublime-text',        args: { appdir: '~/Applications' }

cask 'appcleaner',          args: { appdir: '~/Applications/Utilities' }
cask 'karabiner-elements',  args: { appdir: '~/Applications/Utilities' }
cask 'keka',                args: { appdir: '~/Applications/Utilities' }
cask 'macs-fan-control',    args: { appdir: '~/Applications/Utilities' }
cask 'rectangle',           args: { appdir: '~/Applications/Utilities' }
cask 'vlc',                 args: { appdir: '~/Applications/Utilities' }
