tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'fd'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'pinentry-mac'
brew 'tree'
brew 'vim'

cask 'font-source-code-pro'

cask 'brave-browser',       args: { appdir: '~/Applications' }
cask 'iterm2',              args: { appdir: '~/Applications' }
cask 'omnifocus',           args: { appdir: '~/Applications' }
cask 'sublime-text',        args: { appdir: '~/Applications' }

cask 'alfred',              args: { appdir: '~/Applications/Utilities' }
cask 'appcleaner',          args: { appdir: '~/Applications/Utilities' }
cask 'karabiner-elements',  args: { appdir: '~/Applications/Utilities' }
cask 'keka',                args: { appdir: '~/Applications/Utilities' }
cask 'macs-fan-control',    args: { appdir: '~/Applications/Utilities' }
cask 'pinentry-mac',        args: { appdir: '~/Applications/Utilities' }
cask 'spectacle',           args: { appdir: '~/Applications/Utilities' }
cask 'transmission',        args: { appdir: '~/Applications/Utilities' }
cask 'vanilla',             args: { appdir: '~/Applications/Utilities' }
cask 'vlc',                 args: { appdir: '~/Applications/Utilities' }
